FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
        return -(std::atan2(accel_scaled.x,
                            std::sqrt(accel_scaled.y * accel_scaled.y + accel_scaled.z * accel_scaled.z)) *
                 180.0f) /
               PI;
    }

    Scaled MPU6050::get_yaw() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        const auto accel_scaled{get_acceleration_scaled()};

        return {};
    }

    void MPU6050::i2c_write_bytes(RegAddress const reg_address,
                                  std::uint8_t* write_data,
                                  std::size_t const write_size) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_bus_,
                          std::to_underlying(this->device_address_) << 1,
                          std::to_underlying(reg_address),
                          sizeof(reg_address),
                          write_data,
                          write_size,
                          I2C_TIMEOUT);
    }

    void MPU6050::i2c_write_byte(RegAddress const reg_address, std::uint8_t write_data) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_bus_,
                          std::to_underlying(this->device_address_) << 1,
                          std::to_underlying(reg_address),
                          sizeof(reg_address),
                          &write_data,
                          sizeof(write_data),
                          I2C_TIMEOUT);
    }

    void MPU6050::i2c_write_bit(RegAddress const reg_address,
                                bool const write_data,
                                std::uint8_t const write_position) const noexcept
    {
        std::uint8_t write = this->i2c_read_byte(reg_address);
        if (write_data) {
            write |= (1 << write_position);
        } else {
            write &= ~(1 << write_position);
        }

        HAL_I2C_Mem_Write(this->i2c_bus_,
                          std::to_underlying(this->device_address_) << 1,
                          std::to_underlying(reg_address),
                          sizeof(reg_address),
                          &write,
                          sizeof(write),
                          I2C_TIMEOUT);
    }

    void MPU6050::i2c_write_bits(RegAddress const reg_address,
                                 std::uint8_t const write_data,
                                 std::uint8_t const write_position,
                                 std::uint8_t const write_size) const noexcept
    {
        std::uint8_t write = this->i2c_read_byte(reg_address);
        uint8_t mask = ((1 << write_size) - 1) << (write_position - write_size + 1);
        std::uint8_t temp = write_data;
        temp <<= (write_position - write_size + 1);
        temp &= mask;
        write &= ~(mask);
        write |= temp;

        HAL_I2C_Mem_Write(this->i2c_bus_,
                          std::to_underlying(this->device_address_) << 1,
                          std::to_underlying(reg_address),
                          sizeof(reg_address),
                          &write,
                          sizeof(write),
                          I2C_TIMEOUT);
    }

    void MPU6050::i2c_read_bytes(RegAddress const reg_address,
                                 std::uint8_t* read_data,
                                 std::size_t const read_size) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_bus_,
                          std::to_underlying(this->device_address_) << 1,
                          std::to_underlying(reg_address),
                          sizeof(reg_address),
                          read_data,
                          read_size,
                          I2C_TIMEOUT);
    }

    std::uint8_t MPU6050::i2c_read_byte(RegAddress const reg_address) const noexcept
    {
        std::uint8_t read;
        HAL_I2C_Mem_Write(this->i2c_bus_,
                          std::to_underlying(this->device_address_) << 1,
                          std::to_underlying(reg_address),
                          sizeof(reg_address),
                          &read,
                          sizeof(read),
                          I2C_TIMEOUT);

        return read;
    }

    bool MPU6050::i2c_read_bit(RegAddress const reg_address, std::uint8_t const read_position) const noexcept
    {
        std::uint8_t read;
        HAL_I2C_Mem_Write(this->i2c_bus_,
                          std::to_underlying(this->device_address_) << 1,
                          std::to_underlying(reg_address),
                          sizeof(reg_address),
                          &read,
                          sizeof(read),
                          I2C_TIMEOUT);

        return read & (1 << read_position);
    }

    std::uint8_t MPU6050::i2c_read_bits(RegAddress const reg_address,
                                        std::uint8_t const read_position,
                                        std::uint8_t const read_size) const noexcept
    {
        std::uint8_t read = this->i2c_read_byte(reg_address);
        std::uint8_t mask = ((1 << read_size) - 1) << (read_position - read_size + 1);
        read &= mask;

        return read >> (read_position - read_size + 1);
    }

    void MPU6050::initialize(std::uint32_t const sampling_rate) noexcept
    {
        if (this->get_device_id() == std::to_underlying(this->device_address_)) {
            this->device_reset();
            HAL_Delay(50);
            this->set_sleep_enabled(false);
            HAL_Delay(50);
            this->set_clock_source(Clock::PLL_XGYRO);
            HAL_Delay(50);
            this->set_sampling_divider(get_sampling_divider(sampling_rate, DLPF::BW_256));
            HAL_Delay(50);
            this->set_dlpf_mode(DLPF::BW_256);
            HAL_Delay(50);
            this->set_full_scale_gyro_range(this->gyro_range_);
            HAL_Delay(50);
            this->set_full_scale_accel_range(this->accel_range_);
            HAL_Delay(50);
            this->set_interrupt();
            this->initialized_ = true;
        }
    }

    void MPU6050::deinitialize() noexcept
    {
        if (this->get_device_id() == std::to_underlying(this->device_address_)) {
            this->device_reset();
            this->initialized_ = false;
        }
    }

    void MPU6050::set_sampling_divider(std::uint8_t const divider) const noexcept
    {
        this->i2c_write_byte(RegAddress::SMPLRT_DIV, divider);
    }

