FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
    void MPU6050::set_external_frame_sync(std::uint8_t const frame_sync) const noexcept
    {}

    void MPU6050::set_dlpf_mode(DLPF const dlpf) const noexcept
    {
        this->i2c_write_byte(RegAddress::CONFIG, std::to_underlying(dlpf) & 0x7);
    }

    void MPU6050::set_full_scale_gyro_range(GyroRange const range) const noexcept
    {
        this->i2c_write_byte(RegAddress::GYRO_CONFIG, (std::to_underlying(range) & 0x7) << 3);
    }

    void MPU6050::set_full_scale_accel_range(AccelRange const range) const noexcept
    {
        this->i2c_write_byte(RegAddress::ACCEL_CONFIG, (std::to_underlying(range) & 0x7) << 3);
    }

    void MPU6050::set_dhpf_mode(DHPF const dhpf) const noexcept
    {
        this->i2c_write_byte(RegAddress::ACCEL_CONFIG, std::to_underlying(dhpf) & 0x7);
    }

    void MPU6050::set_free_fall_detection_threshold(std::uint8_t const threshold) const noexcept
    {
        this->i2c_write_byte(RegAddress::FF_THR, threshold);
    }

    void MPU6050::set_free_fall_detection_duration(std::uint8_t const duration) const noexcept
    {
        this->i2c_write_byte(RegAddress::FF_DUR, duration);
    }

    void MPU6050::set_motion_detection_threshold(std::uint8_t const threshold) const noexcept
    {
        this->i2c_write_byte(RegAddress::FF_THR, threshold);
    }

    void MPU6050::set_motion_detection_duration(std::uint8_t const duration) const noexcept
    {
        this->i2c_write_byte(RegAddress::MOT_DUR, duration);
    }

    void MPU6050::set_zero_motion_detection_threshold(std::uint8_t const threshold) const noexcept
    {
        this->i2c_write_byte(RegAddress::ZRMOT_THR, threshold);
    }

    void MPU6050::set_zero_motion_detection_duration(std::uint8_t const duration) const noexcept
    {
        this->i2c_write_byte(RegAddress::ZRMOT_DUR, duration);
    }

    void MPU6050::set_temp_fifo_enabled(bool const temp_fifo) const noexcept
    {
        this->i2c_write_byte(RegAddress::FIFO_EN, temp_fifo << std::to_underlying(FIFO::TEMP_EN_BIT));
    }

    void MPU6050::set_gyro_fifo_enabled(bool const x_fifo, bool const y_fifo, bool const z_fifo) const noexcept
    {}

    void MPU6050::set_accel_fifo_enabled(bool const x_fifo, bool const y_fifo, bool const z_fifo) const noexcept
    {}

    void MPU6050::set_interrupt() const noexcept
    {
        this->set_interrupt_mode(IntrMode::ACTIVEHIGH);
        // this->set_interrupt_drive(IntrDrive::PUSHPULL);
        this->set_interrupt_latch(IntrLatch::PULSE50US);
        this->set_interrupt_latch_clear(IntrClear::ANYREAD);
        this->set_int_enabled(true);
    }

    void MPU6050::set_interrupt_mode(IntrMode const mode) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_PIN_CFG,
                             std::to_underlying(mode) << std::to_underlying(IntrCfg::INT_LEVEL_BIT));
    }

    void MPU6050::set_interrupt_drive(IntrDrive const drive) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_PIN_CFG,
                             std::to_underlying(drive) << std::to_underlying(IntrCfg::INT_OPEN_BIT));
    }

    void MPU6050::set_interrupt_latch(IntrLatch const latch) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_PIN_CFG,
                             std::to_underlying(latch) << std::to_underlying(IntrCfg::INT_RD_CLEAR_BIT));
    }

    void MPU6050::set_interrupt_latch_clear(IntrClear const clear) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_PIN_CFG,
                             std::to_underlying(clear) << std::to_underlying(IntrCfg::LATCH_INT_EN_BIT));
    }

    void MPU6050::set_motion_interrupt() const noexcept
    {
        // Motion interrputs
        // this->set_dhpf_mode(DHPF_5);
        // this->set_int_motion_enabled(true);
        // this->set_int_zero_motion_enabled(true);
        // this->set_int_free_fall_enabled(true);
        // this->set_free_fall_detection_duration(2);
        // this->set_free_fall_detection_threshold(5);
        // this->set_motion_detection_duration(5);
        // this->set_motion_detection_threshold(2);
        // this->set_zero_motion_detection_duration(2);
        // this->set_zero_motion_detection_threshold(4);
    }

    void MPU6050::set_int_enabled(bool const enabled) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_ENABLE, enabled);
    }

    void MPU6050::set_int_data_ready_enabled(bool const enabled) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_ENABLE, enabled << std::to_underlying(Interrupt::DATA_RDY_BIT));
    }

    void MPU6050::set_int_zero_motion_enabled(bool const enabled) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_ENABLE, enabled << std::to_underlying(Interrupt::ZMOT_BIT));
    }

    void MPU6050::set_int_motion_enabled(bool const enabled) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_ENABLE, enabled << std::to_underlying(Interrupt::MOT_BIT));
    }

    void MPU6050::set_int_free_fall_enabled(bool const enabled) const noexcept
    {
        this->i2c_write_byte(RegAddress::INT_ENABLE, enabled << std::to_underlying(Interrupt::FF_BIT));
    }

    void MPU6050::set_int_fifo_overflow_enabled(bool const enabled) const noexcept
    {}

    void MPU6050::set_int_i2c_master_enabled(bool const enabled) const noexcept
    {}

    std::uint8_t MPU6050::get_int_status() const noexcept
    {
        return this->i2c_read_byte(RegAddress::INT_STATUS);
    }

    bool MPU6050::get_int_free_fall_status() const noexcept
    {
        return this->i2c_read_bit(RegAddress::INT_STATUS, std::to_underlying(Interrupt::FF_BIT));
    }

    bool MPU6050::get_int_motion_status() const noexcept
    {
        return this->i2c_read_bit(RegAddress::INT_STATUS, std::to_underlying(Interrupt::MOT_BIT));
    }

    bool MPU6050::get_int_zero_motion_status() const noexcept
    {
        return this->i2c_read_bit(RegAddress::INT_STATUS, std::to_underlying(Interrupt::ZMOT_BIT));
    }

    bool MPU6050::get_int_fifo_overflow_status() const noexcept
    {
        return this->i2c_read_bit(RegAddress::INT_STATUS, std::to_underlying(Interrupt::FIFO_OFLOW_BIT));
    }

    bool MPU6050::get_int_i2c_master_status() const noexcept
    {
        return this->i2c_read_bit(RegAddress::INT_STATUS, std::to_underlying(Interrupt::I2C_MST_INT_BIT));
    }

