FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
    void MPU6050::set_wake_up_frequency(WakeFreq const frequency) const noexcept
    {
        this->i2c_write_byte(RegAddress::PWR_MGMT_2,
                             (std::to_underlying(frequency) & 0x3) << std::to_underlying(Power2::LP_WAKE_CTRL_BIT));
    }

    void
    MPU6050::set_accel_axis_standby(bool const x_standby, bool const y_standby, bool const z_standby) const noexcept
    {
        this->i2c_write_byte(RegAddress::PWR_MGMT_2,
                             (x_standby << std::to_underlying(Power2::STBY_XA_BIT)) |
                                 (y_standby << std::to_underlying(Power2::STBY_YA_BIT)) |
                                 (z_standby << std::to_underlying(Power2::STBY_ZA_BIT)));
    }

    void MPU6050::set_gyro_axis_standby(bool const x_standby, bool const y_standby, bool const z_standby) const noexcept
    {
        this->i2c_write_byte(RegAddress::PWR_MGMT_2,
                             (x_standby << std::to_underlying(Power2::STBY_XG_BIT)) |
                                 (y_standby << std::to_underlying(Power2::STBY_YG_BIT)) |
                                 (z_standby << std::to_underlying(Power2::STBY_ZG_BIT)));
    }

    std::uint16_t MPU6050::get_fifo_count() const noexcept
    {
        std::uint8_t buffer[2];
        this->i2c_read_bytes(RegAddress::FIFO_COUNTH, buffer, sizeof(buffer));

        return ((static_cast<std::uint16_t>(buffer[0]) << 8) | buffer[1]);
    }

    std::uint8_t MPU6050::get_fifo_byte() const noexcept
    {
        return this->i2c_read_byte(RegAddress::FIFO_R_W);
    }

    void MPU6050::get_fifo_bytes(std::uint8_t* data, std::size_t const bytes) const noexcept
    {
        return this->i2c_read_bytes(RegAddress::FIFO_R_W, data, bytes);
    }

    void MPU6050::set_fifo_byte(std::uint8_t const data) const noexcept
    {
        this->i2c_write_byte(RegAddress::FIFO_R_W, data);
    }

    void MPU6050::set_fifo_bytes(std::uint8_t* data, std::size_t const bytes) const noexcept
    {}

    std::uint8_t MPU6050::get_device_id() const noexcept
    {
        return this->i2c_read_byte(RegAddress::WHO_AM_I);
    }

    std::uint8_t MPU6050::get_otp_bank_valid() const noexcept
    {}

    void MPU6050::set_otp_bank_valid(bool const enabled) const noexcept
    {}

    void MPU6050::set_gyro_x_offset_tc(std::int8_t const offset) const noexcept
    {}

    void MPU6050::set_gyro_y_offset_tc(std::int8_t const offset) const noexcept
    {}

    void MPU6050::set_gyro_z_offset_tc(std::int8_t const offset) const noexcept
    {}

    void MPU6050::set_x_fine_gain(std::int8_t const gain) const noexcept
    {}

    void MPU6050::set_y_fine_gain(std::int8_t const gain) const noexcept
    {}

    void MPU6050::set_z_fine_gain(std::int8_t const gain) const noexcept
    {}

    void MPU6050::set_accel_x_offset(std::int16_t const offset) const noexcept
    {}

    void MPU6050::set_accel_y_offset(std::int16_t const offset) const noexcept
    {}

    void MPU6050::set_accel_z_offset(std::int16_t const offset) const noexcept
    {}

    void MPU6050::set_gyro_x_offset(std::int16_t const offset) const noexcept
    {}

    void MPU6050::set_gyro_y_offset(std::int16_t const offset) const noexcept
    {}

    void MPU6050::set_gyro_z_offset(std::int16_t const offset) const noexcept
    {}

    void MPU6050::set_int_pll_ready_enabled(bool const enabled) const noexcept
    {}

    void MPU6050::set_int_dmp_enabled(bool const enabled) const noexcept
    {}

    bool MPU6050::get_dmp_int_5_status() const noexcept
    {}

    bool MPU6050::get_dmp_int_4_status() const noexcept
    {}

    bool MPU6050::get_dmp_int_3_status() const noexcept
    {}

    bool MPU6050::get_dmp_int_2_status() const noexcept
    {}

    bool MPU6050::get_dmp_int_1_status() const noexcept
    {}

    bool MPU6050::get_dmp_int_0_status() const noexcept
    {}

    bool MPU6050::get_int_pll_ready_status() const noexcept
    {}

    bool MPU6050::get_int_dmp_status() const noexcept
    {}

    void MPU6050::set_dmp_enabled(bool const enabled) const noexcept
    {}

    void MPU6050::reset_dmp() const noexcept
    {}

    void
    MPU6050::set_memory_bank(std::uint8_t const bank, bool const prefetch_enabled, bool const user_bank) const noexcept
    {}

    void MPU6050::set_memory_start_address(std::uint8_t const address) const noexcept
    {}

    std::uint8_t MPU6050::read_memory_byte() const noexcept
    {}

    void MPU6050::write_memory_byte(std::uint8_t data) const noexcept
    {}

    void MPU6050::read_memory_block(std::uint8_t* data,
                                    std::size_t const bytes,
                                    std::uint8_t const bank,
                                    std::uint8_t const address) const noexcept
    {}
    void MPU6050::write_memory_block(std::uint8_t* data,
                                     std::size_t const bytes,
                                     std::uint8_t const bank,
                                     std::uint8_t const address,
                                     bool const verify,
                                     bool const use_prog_mem) const noexcept
    {}

    void MPU6050::write_dmp_configuration_set(std::uint8_t* data,
                                              std::size_t const bytes,
                                              bool const use_prog_mem) const noexcept
    {}

    void MPU6050::set_dmp_config1(std::uint8_t const config) const noexcept
    {}

    void MPU6050::set_dmp_config2(std::uint8_t const config) const noexcept
    {}

}; // namespace InvertedSway